app/controllers/houses_controller.rb

SELECT "houses".* FROM "houses" WHERE "houses"."user_id" = ?  [["user_id", 11]]
---
  def index

    @houses = current_user.houses.all

INSERT INTO "houses" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Party Zone"], ["created_at", "2022-01-13 20:25:11.758483"], ["updated_at", "2022-01-13 20:25:11.758483"], ["user_id", 11]]
---
  def create
    @house = House.new(house_params)
    @house.user_id = current_user.id
      if @house.save