app/controllers/plant_spaces_controller.rb

SELECT "plant_spaces".* FROM "plant_spaces"
---
  def index
    @plant_spaces = PlantSpace.all