app/controllers/plants_controller.rb

INSERT INTO "plants" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "olive tree"], ["created_at", "2022-02-03 19:14:37.790354"], ["updated_at", "2022-02-03 19:14:37.790354"]]
---
  def create
    @plant = Plant.new(plant_params)
    if @plant.save