app/controllers/plant_spaces_controller.rb

INSERT INTO "plant_spaces" ("name", "sunlight_rating", "temp", "humidity", "house_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @plant_space = PlantSpace.new(plant_space_params)
    @plant_space.house_id = current_user.houses(id: params[:id])
    if @plant_space.save

SELECT "plant_spaces".* FROM "plant_spaces" WHERE "plant_spaces"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
---
  def set_plant_space
    @plant_space = House.plant_space.find_by(id: params[:id])